raspisanie = {
    'брм1701' : {
        "пн": "⏰ 9:30 - 11:05 \n📖 МКСМ (лекции 1-4 нед.) \n👤 доц. Долин Г.А. \n🧭 ауд. А-310" +
            "\n\n" +
            "⏰ 11:15 - 12:50 \n📖 МКСМ (лекции 1-4 нед.) \n👤 доц. Долин Г.А. \n🧭 ауд. А-310" +
            "\n\n" +
            "⏰ 13:00 - 14:35 \n📖 Электромагнитные поля и волны \n👤 доц. Муравцов А.Д \n🧭 ауд. А-414" +
            "\n\n" +
            "⏰ 15:15 - 16:45 \n📖 ЦОС лаб. \n👤 Фролов А.А.; Минаева О.Н. \n🧭 ауд. Л-603",
        "вт": "⏰ 11:15 - 12:50 \n📖 Основы построения инфокоммуникационных систем и сетей \n👤 доц. Косичкина Т.П. \n🧭 ауд. А-300" +
            "\n\n" +
            "⏰ 13:00 - 14:35 \n📖 Элективные дисциплины по физической культуре \n👤 [_преподаватель_] \n🧭 [_аудитория_]" +
            "\n\n" +
            "⏰ 15:15 - 16:45 \n" + "=== Верхняя неделя === \n" + "📖 ОТС пр.з. \n 👤 [_преподаватель_] \n🧭 ауд. УЛК-1011 \n" + "=== Нижняя неделя === \n" + "📖 ОТС лаб. \n👤 [_преподаватель_] \n🧭 ауд. УЛК-1002" +
            "\n\n" +
            "⏰ 16:55 - 18:25 \n📖 Общая теория связи (лекции 1-12 нед.) \n👤 доц. Поборчая Н.Е. \n🧭 ауд. А-308",
        "ср": "⏰ 9:30 - 11:05 \n 📖 [_название пары_] \n 👤 [_преподаватель_] \n 🧭 [_аудитория_]",
        "чт": "⏰ 9:30 - 11:05 \n 📖 [_название пары_] \n 👤 [_преподаватель_] \n 🧭 [_аудитория_]",
        "пт": "⏰ 9:30 - 11:05 \n 📖 [_название пары_] \n 👤 [_преподаватель_] \n 🧭 [_аудитория_]"
    },
    'брв1701': {
        "пн": "⏰ 13:00 - 14:35 \n📖 Электромагнитные поля и волны \n👤 доц. Муравцов А.Д \n🧭 ауд. А-414" +
            "\n\n" +
            "⏰ 15:15 - 16:45 \n📖 СТУ лаб. \n👤 [_преподаватель_] \n🧭 ауд. Л-505" +
            "\n\n" +
            "⏰ 16:55 - 18:25 \n📖 СТУ ( с 1-2 нед.) пр.з. \n👤 [_преподаватель_] \n🧭 ауд. А-422",
        "вт": "⏰ 11:15 - 12:50 \n📖 Основы построения инфокоммуникационных систем и сетей \n👤 доц. Косичкина Т.П. \n🧭 ауд. А-300" +
            "\n\n" +
            "⏰ 13:00 - 14:35 \n" + "=== Верхняя неделя === \n" + "📖 ОТС пр.з. \n👤 [_преподаватель_] \n🧭 ауд. УЛК-1011 \n" + "=== Нижняя неделя === \n" + "📖 ОТС лаб. \n👤 [_преподаватель_] \n🧭 ауд. УЛК-1002" +
            "\n\n" +
            "⏰ 15:15 - 16:45 \n📖 Элективные дисциплины по физической культуре \n👤 [_преподаватель_] \n🧭 [_аудитория_]" +
            "\n\n" +
            "⏰ 16:55 - 18:25 \n📖 Общая теория связи (лекции 1-12 нед.) \n👤 доц. Поборчая Н.Е. \n🧭 ауд. А-308",
        "ср": "⏰ 11:15 - 12:50 \n📖 КАиПРУТ (лекция 1-4 нед.) с 5 нед. лаб. \n👤 [_преподаватель_] \n🧭 ауд. Л-507" +
            "\n\n" +
            "⏰ 13:00 - 14:35 \n" + "=== Верхняя неделя === \n" + "📖 Вычислительная техника и информационные технологии \n👤 ст.пр. Алешинцев А.В. \n🧭 ауд. А-308 \n" + "=== Нижняя неделя === \n" + "📖 ОПИСиС пр.з. \n👤 [_преподаватель_] \n🧭 ауд. А-358" +
            "\n\n" +
            "⏰ 15:15 - 16:45 \n" + "=== Верхняя неделя === \n" + "📖 ВТиИТ лаб. \n👤 [_преподаватель_] \n🧭 ауд. Л-208 \n" + "=== Нижняя неделя === \n" + "📖 ВТиИТ пр.з. \n👤 [_преподаватель_] \n🧭 ауд. Л-203",
        "чт": "⏰ 9:30 - 11:05 \n📖 Элективные дисциплины по физической культуре \n👤 [_преподаватель_] \n🧭 [_аудитория_]" +
            "\n\n" +
            "⏰ 11:15 - 12:50 \n📖 Цифровая обработка сигналов \n👤 доц. Курахтенков Л.В. \n🧭 ауд. А-310" +
            "\n\n" +
            "⏰ 13:00 - 14:35 \n📖 ЦОС лаб. \n👤 доц. Курахтенков Л.В.; ст. пр. Минаева О.Н. \n🧭 ауд. Л-603",
        "пт": "⏰ 9:30 - 11:05 \n📖 КАиПРУТ (лекции 1-4 нед.) \n👤 доц. Долин Г.А. \n🧭 ауд. А-300" +
            "\n\n" +
            "⏰ 11:15 - 12:50 \n📖 ОПИСиС лаб. \n👤 [_преподаватель_] \n🧭 ауд. А-358" +
            "\n\n" +
            "⏰ 13:00 - 14:35 \n" + "=== Верхняя неделя === \n" + "📖 ЭМПиВ пр.з. \n👤 [_преподаватель_] \n🧭 ауд. А-408 \n" + "=== Нижняя неделя === \n" + "📖 ЭМПиВ лаб. \n👤 [_преподаватель_] \n🧭 ауд. Л-714"
    },
    'зрс1701':{
        "пн": "⏰ 9:30 - 11:05 \n 📖 ЦОС \n 👤 доц. Лобов Е.М. \n 🧭 ауд. А-321"+ "\n\n" + "⏰ 11:15 - 12:50 \n 📖 Электромагнитные поля и волны \n 👤 доц. Муравцов А.Д. \n 🧭 ауд. А-422" + "\n\n" + "⏰ 13:00 - 14:35 \n 📖 Физическая культура",
        "вт": "⏰ 11:15 - 12:50 \n 📖 ТРС лаб. \n 👤  \n 🧭 ауд. Л-603" + "\n\n" + "⏰ 13:00 - 14:35 \n 📖 ТРС \n 👤 Кандауров Н.А \n 🧭 ауд. Л-601"  + "\n\n" + "⏰ 15:15 - 16:45 \n 📖 ТРС \n 👤 Кандауров Н.А \n 🧭 ауд. Л-601" + "\n\n" + "⏰ 16:55 - 18:25 \n 📖 Физическая культура",
        "ср": "⏰ 11:15 - 12:50 \n 📖 ЭиС \n 👤 ст.пр. Ильина Л.Н. \n 🧭 ауд. А-407" + "\n\n" + "⏰ 13:00 - 14:35 \n 📖 ЭиС пр.з. \n 👤 ст.пр. Ильина Л.Н. \n 🧭 ауд. А-407",
        "чт": "⏰ 9:30 - 11:05 \n 📖 УПсУИБ \n 👤 Симонов П.И. \n 🧭 ауд. ЗФ-301" + "\n\n" + "⏰ 11:15 - 12:50 \n 📖 ОПсУИБ \n 👤 Симонов П.И. \n 🧭 ауд. ЗФ-301" + "\n\n" + "⏰ 13:00 - 14:35 \n 📖 ОПсУИБ \n 👤 Симонов П.И. \n 🧭 ауд. ЗФ-301",
        "пт": "⏰ 9:30 - 11:05 \n" + "=== Верхняя неделя === \n" + "📖 ЭМПиВ пр.з. \n 👤  \n 🧭 ауд. А-407 \n" + "=== Нижняя неделя === \n" + "📖 ЭМПиВ лаб. \n 👤  \n 🧭 ауд. Л-714" + "\n\n" + "⏰ 11:15 - 12:50 \n" + "=== Верхняя неделя === \n" + "📖 ТЭС лаб. \n 👤  \n 🧭 ауд. А-  \n" + "=== Нижняя неделя === \n" + "📖 ТЭС пр.з. \n 👤  \n 🧭 ауд. А-409" + "\n\n" + "⏰ 13:00 - 14:35 \n 📖 ТЭС \n 👤 доц. Мамонтов А.В.  \n 🧭 ауд. А-409" + "\n\n" + "⏰ 15:15 - 16:45 \n 📖 ТРС лаб. \n 👤  \n 🧭 ауд. Л-603"
    },
    # Тестовая группа с тестовым днём
    'test':{
        "пн": "⏰ 9:30 - 11:05 \n 📖 [_название пары_] \n 👤 [_преподаватель_] \n 🧭 [_аудитория_]" + 
            "\n\n" + 
            "⏰ 11:15 - 12:50 \n" + "=== Верхняя неделя === \n" + "📖 [_название пары_] \n 👤 [_преподаватель_] \n 🧭 [_аудитория_] \n" + "=== Нижняя неделя === \n" + "📖 [_название пары_] \n 👤 [_преподаватель_] \n 🧭 [_аудитория_]"
    }
}
