raspisanie = {
    'брм1701' : {
        1 :{
            "пн": "=== Верхняя неделя === \n" +
                "⏰ 9:30 - 11:05 \n📖 МКСМ (лекции 1-4 нед.) \n👤 доц. Долин Г.А. \n🧭 ауд. А-310" +
                "\n\n" +
                "⏰ 11:15 - 12:50 \n📖 МКСМ (лекции 1-4 нед.) \n👤 доц. Долин Г.А. \n🧭 ауд. А-310" +
                "\n\n" +
                "⏰ 13:00 - 14:35 \n📖 Электромагнитные поля и волны \n👤 доц. Муравцов А.Д \n🧭 ауд. А-414" +
                "\n\n" +
                "⏰ 15:15 - 16:45 \n📖 ЦОС лаб. \n👤 Фролов А.А.; Минаева О.Н. \n🧭 ауд. Л-603",
            "вт": "=== Верхняя неделя === \n" +
                "⏰ 11:15 - 12:50 \n📖 Основы построения инфокоммуникационных систем и сетей \n👤 доц. Косичкина Т.П. \n🧭 ауд. А-300" +
                "\n\n" +
                "⏰ 13:00 - 14:35 \n📖 Элективные дисциплины по физической культуре \n👤 [_преподаватель_] \n🧭 [_аудитория_]" +
                "\n\n" +
                "⏰ 15:15 - 16:45 \n📖 ОТС пр.з. \n 👤 [_преподаватель_] \n🧭 ауд. УЛК-1011" + 
                "\n\n" +
                "⏰ 16:55 - 18:25 \n📖 Общая теория связи (лекции 1-12 нед.) \n👤 доц. Поборчая Н.Е. \n🧭 ауд. А-308",
            "ср": "=== Верхняя неделя === \n" +
                "⏰ 9:30 - 11:05 \n📖 СТУ (с 1-2 нед.) пр.з. \n👤 [_преподаватель_] \n🧭 ауд. А-422" + 
                "\n\n" +
                "⏰ 11:15 - 12:50 \n📖 ВТиИТ лаб. \n👤 [_преподаватель_] \n🧭 ауд. Л-208" + 
                "\n\n" +
                "⏰ 13:00 - 14:35 \n📖 Вычислительная техника и информационные технологии \n👤 ст.пр. Алешинцев А.В. \n🧭 ауд. А-308",
            "чт": "=== Верхняя неделя === \n" +
                "⏰ 9:30 - 11:05 \n📖 Элективные дисциплины по физической культуре \n👤 [_преподаватель_] \n🧭 [_аудитория_]" + 
                "\n\n" +
                "⏰ 11:15 - 12:50 \n📖 Цифровая обработка сигналов \n👤 доц. Курахтенков Л.В. \n🧭 ауд. А-310" + 
                "\n\n" +
                "⏰ 13:00 - 14:35 \n📖 ЭМПиВ лаб. \n👤 [_преподаватель_] \n🧭 ауд. Л-714",
            "пт": "=== Верхняя неделя === \n" +
                "⏰ 11:15 - 13:50 \n📖 СТУ лаб. \n👤 [_преподаватель_] \n🧭 ауд. Л-505 " + 
                "\n\n" +
                "⏰ 13:00 - 14:35 \n📖 ОПИСиС лаб. \n👤 [_преподаватель_] \n🧭 ауд. А-358"
        },
        2 :{
            "пн": "=== Нижняя неделя === \n" + 
                "⏰ 9:30 - 11:05 \n📖 МКСМ (лекции 1-4 нед.) \n👤 доц. Долин Г.А. \n🧭 ауд. А-310" +
                "\n\n" +
                "⏰ 11:15 - 12:50 \n📖 МКСМ (лекции 1-4 нед.) \n👤 доц. Долин Г.А. \n🧭 ауд. А-310" +
                "\n\n" +
                "⏰ 13:00 - 14:35 \n📖 Электромагнитные поля и волны \n👤 доц. Муравцов А.Д \n🧭 ауд. А-414" +
                "\n\n" +
                "⏰ 15:15 - 16:45 \n📖 ЦОС лаб. \n👤 Фролов А.А.; Минаева О.Н. \n🧭 ауд. Л-603",
            "вт": "=== Нижняя неделя === \n" + 
                "⏰ 11:15 - 12:50 \n📖 Основы построения инфокоммуникационных систем и сетей \n👤 доц. Косичкина Т.П. \n🧭 ауд. А-300" +
                "\n\n" +
                "⏰ 13:00 - 14:35 \n📖 Элективные дисциплины по физической культуре \n👤 [_преподаватель_] \n🧭 [_аудитория_]" +
                "\n\n" +
                "⏰ 15:15 - 16:45 \n📖 ОТС лаб. \n👤 [_преподаватель_] \n🧭 ауд. УЛК-1002" +
                "\n\n" +
                "⏰ 16:55 - 18:25 \n📖 Общая теория связи (лекции 1-12 нед.) \n👤 доц. Поборчая Н.Е. \n🧭 ауд. А-308",
            "ср": "=== Нижняя неделя === \n" + 
                "⏰ 9:30 - 11:05 \n📖 МКСМ (с 5 нед.) лаб. \n👤 [_преподаватель_] \n🧭 ауд. Л-505" + 
                "\n\n" +
                "⏰ 11:15 - 12:50 \n📖 ОПИСиС пр.з. \n👤 [_преподаватель_] \n🧭 ауд. А-358" + 
                "\n\n" +
                "⏰ 13:00 - 14:35 \n📖 ВТиИТ пр.з. \n👤 [_преподаватель_] \n🧭 ауд. Л-203",
            "чт": "=== Нижняя неделя === \n" + 
                "⏰ 9:30 - 11:05 \n📖 Элективные дисциплины по физической культуре \n👤 [_преподаватель_] \n🧭 [_аудитория_]" + 
                "\n\n" +
                "⏰ 11:15 - 12:50 \n📖 Цифровая обработка сигналов \n👤 доц. Курахтенков Л.В. \n🧭 ауд. А-310" + 
                "\n\n" +
                "⏰ 13:00 - 14:35 \n📖 ЭМПиВ пр.з. \n👤 [_преподаватель_] \n🧭 ауд. А-408",
            "пт": "=== Нижняя неделя === \n" + 
                "⏰ 11:15 - 13:50 \n📖 СТУ лаб. \n👤 [_преподаватель_] \n🧭 ауд. Л-505 " + 
                "\n\n" +
                "⏰ 13:00 - 14:35 \n📖 ОПИСиС лаб. \n👤 [_преподаватель_] \n🧭 ауд. А-358"
        }
    },
    'брв1701': {
        1 :{
            "пн": "=== Верхняя неделя === \n" + 
                "⏰ 13:00 - 14:35 \n📖 Электромагнитные поля и волны \n👤 доц. Муравцов А.Д \n🧭 ауд. А-414" +
                "\n\n" +
                "⏰ 15:15 - 16:45 \n📖 СТУ лаб. \n👤 [_преподаватель_] \n🧭 ауд. Л-505" +
                "\n\n" +
                "⏰ 16:55 - 18:25 \n📖 СТУ ( с 1-2 нед.) пр.з. \n👤 [_преподаватель_] \n🧭 ауд. А-422",
            "вт": "=== Верхняя неделя === \n" + 
                "⏰ 11:15 - 12:50 \n📖 Основы построения инфокоммуникационных систем и сетей \n👤 доц. Косичкина Т.П. \n🧭 ауд. А-300" +
                "\n\n" +
                "⏰ 13:00 - 14:35 \n📖 ОТС пр.з. \n👤 [_преподаватель_] \n🧭 ауд. УЛК-1011" + 
                "\n\n" +
                "⏰ 15:15 - 16:45 \n📖 Элективные дисциплины по физической культуре \n👤 [_преподаватель_] \n🧭 [_аудитория_]" +
                "\n\n" +
                "⏰ 16:55 - 18:25 \n📖 Общая теория связи (лекции 1-12 нед.) \n👤 доц. Поборчая Н.Е. \n🧭 ауд. А-308",
            "ср": "=== Верхняя неделя === \n" + 
                "⏰ 11:15 - 12:50 \n📖 КАиПРУТ (лекция 1-4 нед.) с 5 нед. лаб. \n👤 [_преподаватель_] \n🧭 ауд. Л-507" +
                "\n\n" +
                "⏰ 13:00 - 14:35 \n📖 Вычислительная техника и информационные технологии \n👤 ст.пр. Алешинцев А.В. \n🧭 ауд. А-308 \n" + 
                "\n\n" +
                "⏰ 15:15 - 16:45 \n📖 ВТиИТ лаб. \n👤 [_преподаватель_] \n🧭 ауд. Л-208 \n",
            "чт": "=== Верхняя неделя === \n" + 
                "⏰ 9:30 - 11:05 \n📖 Элективные дисциплины по физической культуре \n👤 [_преподаватель_] \n🧭 [_аудитория_]" +
                "\n\n" +
                "⏰ 11:15 - 12:50 \n📖 Цифровая обработка сигналов \n👤 доц. Курахтенков Л.В. \n🧭 ауд. А-310" +
                "\n\n" +
                "⏰ 13:00 - 14:35 \n📖 ЦОС лаб. \n👤 доц. Курахтенков Л.В.; ст. пр. Минаева О.Н. \n🧭 ауд. Л-603",
            "пт": "=== Верхняя неделя === \n" + 
                "⏰ 9:30 - 11:05 \n📖 КАиПРУТ (лекции 1-4 нед.) \n👤 доц. Долин Г.А. \n🧭 ауд. А-300" +
                "\n\n" +
                "⏰ 11:15 - 12:50 \n📖 ОПИСиС лаб. \n👤 [_преподаватель_] \n🧭 ауд. А-358" +
                "\n\n" +
                "⏰ 13:00 - 14:35 \n" + "=== Верхняя неделя === \n" + "📖 ЭМПиВ пр.з. \n👤 [_преподаватель_] \n🧭 ауд. А-408 \n" + "=== Нижняя неделя === \n" + "📖 ЭМПиВ лаб. \n👤 [_преподаватель_] \n🧭 ауд. Л-714"
        },
        2 :{
            "пн": "=== Нижняя неделя === \n" + 
                "⏰ 13:00 - 14:35 \n📖 Электромагнитные поля и волны \n👤 доц. Муравцов А.Д \n🧭 ауд. А-414" +
                "\n\n" +
                "⏰ 15:15 - 16:45 \n📖 СТУ лаб. \n👤 [_преподаватель_] \n🧭 ауд. Л-505" +
                "\n\n" +
                "⏰ 16:55 - 18:25 \n📖 СТУ ( с 1-2 нед.) пр.з. \n👤 [_преподаватель_] \n🧭 ауд. А-422",
            "вт": "=== Нижняя неделя === \n" + 
                "⏰ 11:15 - 12:50 \n📖 Основы построения инфокоммуникационных систем и сетей \n👤 доц. Косичкина Т.П. \n🧭 ауд. А-300" +
                "\n\n" +
                "⏰ 13:00 - 14:35 \n📖 ОТС лаб. \n👤 [_преподаватель_] \n🧭 ауд. УЛК-1002" +
                "\n\n" +
                "⏰ 15:15 - 16:45 \n📖 Элективные дисциплины по физической культуре \n👤 [_преподаватель_] \n🧭 [_аудитория_]" +
                "\n\n" +
                "⏰ 16:55 - 18:25 \n📖 Общая теория связи (лекции 1-12 нед.) \n👤 доц. Поборчая Н.Е. \n🧭 ауд. А-308",
            "ср": "=== Нижняя неделя === \n" + 
                "⏰ 11:15 - 12:50 \n📖 КАиПРУТ (лекция 1-4 нед.) с 5 нед. лаб. \n👤 [_преподаватель_] \n🧭 ауд. Л-507" +
                "\n\n" +
                "⏰ 13:00 - 14:35 \n📖 ОПИСиС пр.з. \n👤 [_преподаватель_] \n🧭 ауд. А-358" +
                "\n\n" +
                "⏰ 15:15 - 16:45 \n📖 ВТиИТ пр.з. \n👤 [_преподаватель_] \n🧭 ауд. Л-203",
            "чт": "=== Нижняя неделя === \n" + 
                "⏰ 9:30 - 11:05 \n📖 Элективные дисциплины по физической культуре \n👤 [_преподаватель_] \n🧭 [_аудитория_]" +
                "\n\n" +
                "⏰ 11:15 - 12:50 \n📖 Цифровая обработка сигналов \n👤 доц. Курахтенков Л.В. \n🧭 ауд. А-310" +
                "\n\n" +
                "⏰ 13:00 - 14:35 \n📖 ЦОС лаб. \n👤 доц. Курахтенков Л.В.; ст. пр. Минаева О.Н. \n🧭 ауд. Л-603",
            "пт": "=== Нижняя неделя === \n" + 
                "⏰ 9:30 - 11:05 \n📖 КАиПРУТ (лекции 1-4 нед.) \n👤 доц. Долин Г.А. \n🧭 ауд. А-300" +
                "\n\n" +
                "⏰ 11:15 - 12:50 \n📖 ОПИСиС лаб. \n👤 [_преподаватель_] \n🧭 ауд. А-358" +
                "\n\n" +
                "⏰ 13:00 - 14:35 \n📖 ЭМПиВ лаб. \n👤 [_преподаватель_] \n🧭 ауд. Л-714"
        }
    },
    'зрс1701':{
        1 :{
            "пн": "=== Верхняя неделя === \n" +
                "⏰ 9:30 - 11:05 \n📖 ЦОС \n👤 доц. Лобов Е.М. \n🧭 ауд. А-321" + 
                "\n\n" + 
                "⏰ 11:15 - 12:50 \n📖 Электромагнитные поля и волны \n👤 доц. Муравцов А.Д. \n🧭 ауд. А-422",
            "вт": "=== Верхняя неделя === \n" +
                "⏰ 9:30 - 11:05 \n📖 ТРС лаб. \n👤 [_преподаватель_] \n🧭 ауд. Л-603" + 
                "\n\n" + 
                "⏰ 11:15 - 12:50 \n📖 ЦОС пр.з. \n👤 Мирошникова Н.Е. \n🧭 ауд. Л-615" + 
                "\n\n" + 
                "⏰ 13:00 - 14:35 \n📖 ТРС \n👤 Кандауров Н.А \n🧭 ауд. Л-601" + 
                "\n\n" + 
                #"⏰ 15:15 - 16:45 \n" + "=== Верхняя неделя === \n" + "📖 ТРС \n👤 Кандауров Н.А \n🧭 ауд. Л-601 \n" + "=== Нижняя неделя === \n" + "📖 ТРС пр.з. \n👤 [_преподаватель_] \n🧭 ауд. Л-607" + 
                #"\n\n" + 
                "⏰ 15:15 - 16:45 \n📖 Физическая культура",
            "ср": "=== Верхняя неделя === \n" +
                "⏰ 9:30 - 11:05 \n📖 КиОЭ лаб. \n👤 [_преподаватель_] \n🧭 [_аудитория_]" + 
                "\n\n" + 
                "⏰ 11:15 - 12:50 \n📖 ЭиС \n👤 ст.пр. Ильина Л.Н. \n🧭 ауд. А-407" + 
                "\n\n" + 
                "⏰ 13:00 - 14:35 \n📖 ЭиС пр.з. \n👤 ст.пр. Ильина Л.Н. \n🧭 ауд. Л-505" + 
                "\n\n" + 
                "⏰ 15:15 - 16:45 \n📖 КиОЭ лаб. \n👤 проф. Елизаров А.А. \n🧭 [_аудитория_]" + 
                "\n\n" + 
                "⏰ 16:55 - 18:25 \n📖 Физическая культура",
            "чт": "=== Верхняя неделя === \n" +
                "⏰ 9:30 - 11:05 \n📖 УПсУИБ \n👤 Симонов П.И. \n🧭 ауд. ЗФ-301" + 
                "\n\n" + 
                "⏰ 11:15 - 12:50 \n📖 ОПсУИБ \n👤 Симонов П.И. \n🧭 ауд. ЗФ-301" + 
                "\n\n" + 
                "⏰ 13:00 - 14:35 \n📖 ОПсУИБ \n👤 Симонов П.И. \n🧭 ауд. ЗФ-301",
            "пт": "=== Верхняя неделя === \n" +
                "⏰ 9:30 - 11:05 \n📖 ЭМПиВ пр.з. \n👤 доц. Муравцов А.Д. \n🧭 ауд. А-407" + 
                "\n\n" + 
                "⏰ 11:15 - 12:50 \n📖 ТЭС лаб. \n👤 [_преподаватель_] \n🧭 ауд. Л-1010" + 
                "\n\n" + 
                "⏰ 13:00 - 14:35 \n📖 ТЭС \n👤 доц. Мамонтов А.В. \n🧭 ауд. Л-1011"
        },
        2 :{
            "пн": "=== Нижняя неделя === \n" + 
                "⏰ 9:30 - 11:05 \n📖 ЦОС \n👤 доц. Лобов Е.М. \n🧭 ауд. А-321" + 
                "\n\n" + 
                "⏰ 11:15 - 12:50 \n📖 Электромагнитные поля и волны \n👤 доц. Муравцов А.Д. \n🧭 ауд. А-422",
            "вт": "=== Нижняя неделя === \n" + 
                "⏰ 9:30 - 11:05 \n📖 ТРС лаб. \n👤 [_преподаватель_] \n🧭 ауд. Л-603" + 
                "\n\n" + 
                "⏰ 11:15 - 12:50 \n📖 ЦОС лаб. \n👤 Мирошникова Н.Е.; Минаева О.Н. \n🧭 ауд. Л-603" + 
                "\n\n" + 
                "⏰ 13:00 - 14:35 \n📖 ТРС \n👤 Кандауров Н.А \n🧭 ауд. Л-601" + 
                "\n\n" + 
                #"⏰ 15:15 - 16:45 \n" + "=== Верхняя неделя === \n" + "📖 ТРС \n👤 Кандауров Н.А \n🧭 ауд. Л-601 \n" + "=== Нижняя неделя === \n" + "📖 ТРС пр.з. \n👤 [_преподаватель_] \n🧭 ауд. Л-607" + 
                #"\n\n" + 
                "⏰ 15:15 - 16:45 \n📖 Физическая культура",
            "ср": "=== Нижняя неделя === \n" + 
                "⏰ 11:15 - 12:50 \n📖 ЭиС \n👤 ст.пр. Ильина Л.Н. \n🧭 ауд. А-407" + 
                "\n\n" + 
                "⏰ 13:00 - 14:35 \n📖 ЭиС лаб. \n👤 ст.пр. Ильина Л.Н. \n🧭 ауд. Л-505" + 
                "\n\n" + 
                "⏰ 15:15 - 16:45 \n📖 КиОЭ \n👤 проф. Елизаров А.А. \n🧭 ауд. А-306" + 
                "\n\n" + 
                "⏰ 16:55 - 18:25 \n📖 Физическая культура",
            "чт": "=== Нижняя неделя === \n" + 
                "⏰ 13:00 - 14:35 \n📖 ОПсУИБ \n👤 Симонов П.И. \n🧭 ауд. ЗФ-301" + 
                "\n\n" + 
                "⏰ 15:15 - 16:45 \n📖 УПсУИБ \n👤 Симонов П.И. \n🧭 ауд. А-407",
            "пт": "=== Нижняя неделя === \n" + 
                "⏰ 9:30 - 11:05 \n📖 ЭМПиВ лаб. \n👤 [_преподаватель_] \n🧭 ауд. Л-714" + 
                "\n\n" + 
                "⏰ 11:15 - 12:50 \n📖 ТЭС пр.з. \n👤 доц. Мамонтов А.В. \n🧭 ауд. Л-1011" + 
                "\n\n" + 
                "⏰ 13:00 - 14:35 \n📖 ТЭС \n👤 доц. Мамонтов А.В. \n🧭 ауд. Л-1011"
        }
    },
    'бут1701':{
        1 :{
            "пн": "=== Верхняя неделя === \n" + 
                "⏰ 11:15 - 12:50 \n📖 Программная инженерия лаб. \n👤 доц. Шукенбаев А.Б. \n🧭 ауд. А-421" + 
                "\n\n" + 
                "⏰ 13:00 - 14:35 \n📖 Программная инженерия лек. \n👤 доц. Шукенбаев А.Б. \n🧭 ауд. А-106" + 
                "\n\n" + 
                "⏰ 15:15 - 16:45 \n📖 ПО систем управления (лекции 1-7 нед., пр.з. 8-18 нед.) \n👤 доц. Тутова Н.В. \n🧭 ауд. А-421" + 
                "\n\n" + 
                "⏰ 16:55 - 18:25 \n📖 ЭЛЕКТИВНЫЕ ДИСЦ. ПО ФИЗИЧЕСКОЙ КУЛЬТУРЕ \n👤 [_преподаватель_] \n🧭 [_аудитория_]",
            "вт": "=== Верхняя неделя === \n" + 
                "⏰ 9:30 - 11:05 \n📖 Экология лаб. \n👤 [_преподаватель_] \n🧭 ауд. А-155" + 
                "\n\n" + 
                "⏰ 11:15 - 12:50 \n📖 МСиС \n👤 проф. Сенявский А.Л. \n🧭 ауд. А-407" + 
                "\n\n" + 
                "⏰ 13:00 - 14:35 \n📖 Экология \n👤 доц. Ерофеева В.В. \n🧭 ауд. А-301",
            "ср": "=== Верхняя неделя === \n" + 
                "⏰ 9:30 - 11:05 \n📖 SCADA-системы пр.з. \n👤 [_преподаватель_] \n🧭 ауд. А-106" + 
                "\n\n" + 
                "⏰ 11:15 - 12:50 \n📖 Основы маркетинга лек. \n👤 ст. пр. Добычина И.В. \n🧭 ауд. А-170",
            "чт": "=== Верхняя неделя === \n" + 
                "⏰ 9:30 - 11:05 \n📖 ЭЛЕКТИВНЫЕ ДИСЦ. ПО ФИЗИЧЕСКОЙ КУЛЬТУРЕ \n👤 [_преподаватель_] \n🧭 [_аудитория_]" + 
                "\n\n" + 
                "⏰ 11:15 - 12:50 \n📖 Теория автоматического управления \n👤 доц. Верба В.А. \n🧭 ауд. А-332" + 
                "\n\n" + 
                "⏰ 13:00 - 14:35 \n📖 Теория автоматического управления лаб. \n👤 [_преподаватель_] \n🧭 ауд. А-501",
            "пт": "=== Верхняя неделя === \n" + 
                "⏰ 9:30 - 11:05 \n📖 МСиС лаб. \n👤 [_преподаватель_] \n🧭 ауд. А-435" + 
                "\n\n" + 
                "⏰ 11:15 - 12:50 \n📖 Сетевые технологии лаб. \n👤 [_преподаватель_] \n🧭 ауд. А-245" + 
                "\n\n" + 
                "⏰ 13:00 - 14:35 \n📖 SCADA-системы \n👤 доц. Исаева Л.Н. \n🧭 ауд. А-106"
        },
        2 :{
            "пн": "=== Нижняя неделя === \n" + 
                "⏰ 11:15 - 12:50 \n📖 Программная инженерия лаб. \n👤 доц. Шукенбаев А.Б. \n🧭 ауд. А-421" + 
                "\n\n" + 
                "⏰ 13:00 - 14:35 \n📖 Программная инженерия лек. \n👤 доц. Шукенбаев А.Б. \n🧭 ауд. А-106" + 
                "\n\n" + 
                "⏰ 15:15 - 16:45 \n📖 ПО систем управления (лекции 1-7 нед., пр.з. 8-18 нед.) \n👤 доц. Тутова Н.В. \n🧭 ауд. А-421" + 
                "\n\n" + 
                "⏰ 16:55 - 18:25 \n📖 ЭЛЕКТИВНЫЕ ДИСЦ. ПО ФИЗИЧЕСКОЙ КУЛЬТУРЕ \n👤 [_преподаватель_] \n🧭 [_аудитория_]",
            "вт": "=== Нижняя неделя === \n" + 
                "⏰ 9:30 - 11:05 \n📖 Экология лаб. \n👤 [_преподаватель_] \n🧭 ауд. А-155" + 
                "\n\n" + 
                "⏰ 11:15 - 12:50 \n📖 МСиС \n👤 проф. Сенявский А.Л. \n🧭 ауд. А-407" + 
                "\n\n" + 
                "⏰ 13:00 - 14:35 \n📖 Экология \n👤 доц. Ерофеева В.В. \n🧭 ауд. А-301",
            "ср": "=== Нижняя неделя === \n" + 
                "⏰ 9:30 - 11:05 \n📖 SCADA-системы лаб. \n👤 [_преподаватель_] \n🧭 ауд. А-421" + 
                "\n\n" + 
                "⏰ 11:15 - 12:50 \n📖 Основы маркетинга пр. з. \n👤 ст. пр. Добычина И.В. \n🧭 ауд. А-170",
            "чт": "=== Нижняя неделя === \n" + 
                "⏰ 9:30 - 11:05 \n📖 ЭЛЕКТИВНЫЕ ДИСЦ. ПО ФИЗИЧЕСКОЙ КУЛЬТУРЕ \n👤 [_преподаватель_] \n🧭 [_аудитория_]" + 
                "\n\n" + 
                "⏰ 11:15 - 12:50 \n📖 Сетевые технологии \n👤 ст.пр. Смирнов А.Э. \n🧭 ауд. А-414" + 
                "\n\n" + 
                "⏰ 13:00 - 14:35 \n📖 Теория автоматического управления пр.з. \n👤 [_преподаватель_] \n🧭 ауд. А-421",
            "пт": "=== Нижняя неделя === \n" + 
                "⏰ 9:30 - 11:05 \n📖 МСиС лаб. \n👤 [_преподаватель_] \n🧭 ауд. А-435" + 
                "\n\n" + 
                "⏰ 11:15 - 12:50 \n📖 Сетевые технологии пр.з. \n👤 [_преподаватель_] \n🧭 ауд. А-245" + 
                "\n\n" + 
                "⏰ 13:00 - 14:35 \n📖 SCADA-системы \n👤 доц. Исаева Л.Н. \n🧭 ауд. А-106"
        }
    },
    'бст1701':{
        1 :{
            "пн": "=== Верхняя неделя === \n" +
                "⏰ 13:00 - 14:35 \n📖 Операционные системы лаб. \n👤 [_преподаватель_] \n🧭 ауд. Л-504",
            "вт": "=== Верхняя неделя === \n" +
                "⏰ 9:30 - 11:05 \n📖 Архитектура информационных систем лаб. \n👤 [_преподаватель_] \n🧭 ауд. Л-207" + 
                "\n\n" + 
                "⏰ 11:15 - 12:50 \n📖 Основы ЭиЭЭ \n👤 проф. Захаров И.А. \n🧭 ауд. А-222" + 
                "\n\n" + 
                "⏰ 13:00 - 14:35 \n📖 ЭЛЕКТИВНЫЕ ДИСЦ. ПО ФИЗИЧЕСКОЙ КУЛЬТУРЕ \n👤 [_преподаватель_] \n🧭 [_аудитория_]",
            "ср": "=== Верхняя неделя === \n" +
                "⏰ 9:30 - 11:05 \n📖 Основы информационной безопасности пр.з. \n👤 [_преподаватель_] \n🧭 ауд. А-260" + 
                "\n\n" + 
                "⏰ 11:15 - 12:50 \n📖 Операционные системы \n👤 ст. пр. Королькова Т.В. \n🧭 ауд. А-308" + 
                "\n\n" + 
                "⏰ 13:00 - 14:35 \n📖 Сетевые технологии лаб. \n👤 [_преподаватель_] \n🧭 ауд. А-261" + 
                "\n\n" + 
                "⏰ 15:15 - 16:45 \n📖 СиМРИС лаб. \n👤 [_преподаватель_] \n🧭 ауд. Л-211",
            "чт": "=== Верхняя неделя === \n" +
                "⏰ 11:15 - 12:50 \n📖 Основы программрования в КИС лекции 1-6 нед. \n👤 ст. пр. Тутов А.В. \n🧭 ауд А-300" + 
                "\n\n" + 
                "⏰ 13:00 - 14:35 \n📖 ЭЛЕКТИВНЫЕ ДИСЦ. ПО ФИЗИЧЕСКОЙ КУЛЬТУРЕ \n👤 [_преподаватель_] \n🧭 [_аудитория_]" + 
                "\n\n" + 
                "⏰ 15:15 - 16:45 \n📖 Архитектура информационных систем пр.з. \n👤 [_преподаватель_] \n🧭 ауд. Л-207",
            "пт": "=== Верхняя неделя === \n" +
                "⏰ 9:30 - 11:05 \n📖 Сетевые технологии пр.з. \n👤 [_преподаватель_] \n🧭 ауд. А-245"
        },
        2 :{
            "пн": "=== Нижняя неделя === \n" + 
                "⏰ 13:00 - 14:35 \n📖 Операционные системы пр.з. \n👤 [_преподаватель_] \n🧭 ауд. Л-208",
            "вт": "=== Нижняя неделя === \n" + 
                "⏰ 9:30 - 11:05 \n📖 Архитектура информационных систем лаб. \n👤 [_преподаватель_] \n🧭 ауд. Л-207" + 
                "\n\n" + 
                "⏰ 11:15 - 12:50 \n📖 Сетевые технологии \n👤 ст.пр. Смирнов А.Э. \n🧭 ауд. А-414" + 
                "\n\n" + 
                "⏰ 13:00 - 14:35 \n📖 ЭЛЕКТИВНЫЕ ДИСЦ. ПО ФИЗИЧЕСКОЙ КУЛЬТУРЕ \n👤 [_преподаватель_] \n🧭 [_аудитория_]",
            "ср": "=== Нижняя неделя === \n" + 
                "⏰ 9:30 - 11:05 \n📖 Основы информационной безопасности пр.з. \n👤 [_преподаватель_] \n🧭 ауд. А-260" + 
                "\n\n" + 
                "⏰ 11:15 - 12:50 \n📖 Операционные системы \n👤 ст. пр. Королькова Т.В. \n🧭 ауд. А-308" + 
                "\n\n" + 
                "⏰ 13:00 - 14:35 \n📖 Сетевые технологии лаб. \n👤 [_преподаватель_] \n🧭 ауд. А-261" + 
                "\n\n" + 
                "⏰ 15:15 - 16:45 \n📖 СиМРИС пр.з. \n👤 [_преподаватель_] \n🧭 ауд. Л-211",
            "чт": "=== Нижняя неделя === \n" + 
                "⏰ 11:15 - 12:50 \n📖 ОП в КИС пр.з. 7-18 нед. \n👤 [_преподаватель_] \n🧭 ауд. ВЦ-705" + 
                "\n\n" + 
                "⏰ 13:00 - 14:35 \n📖 ЭЛЕКТИВНЫЕ ДИСЦ. ПО ФИЗИЧЕСКОЙ КУЛЬТУРЕ \n👤 [_преподаватель_] \n🧭 [_аудитория_]" + 
                "\n\n" + 
                "⏰ 15:15 - 16:45 \n📖 Архитектура информационных систем пр.з. \n👤 [_преподаватель_] \n🧭 ауд. Л-207",
            "пт": "=== Нижняя неделя === \n" + 
                "⏰ 9:30 - 11:05 \n📖 Сетевые технологии пр.з. \n👤 [_преподаватель_] \n🧭 ауд. А-245"
        }
    },
    'бст1703':{
        1 :{
            "пн": "=== Верхняя неделя === \n" + 
                "⏰ 11:15 - 12:50 \n📖 Средства и методы разработки информационных систем \n👤 доц. Гузеев А.В. \n🧭 ауд. А-300" + 
                "\n\n" + 
                "⏰ 13:00 - 14:35 \n📖 СиМРИС лаб. \n👤 [_преподаватель_] \n🧭 ауд. Л-211",
            "вт": "=== Верхняя неделя === \n" + 
                "⏰ 9:30 - 11:05 \n📖 Архитектура информационных систем лаб. \n👤 [_преподаватель_] \n🧭 ауд. Л-207" + 
                "\n\n" + 
                "⏰ 11:15 - 12:50 \n📖 Основы ЭиЭЭ \n👤 проф. Захаров И.А. \n🧭 ауд. А-222" + 
                "\n\n" + 
                "⏰ 13:00 - 14:35 \n📖 Основы ЭиЭЭ пр.з. \n👤 [_преподаватель_] \n🧭 ауд. А-222" + 
                "\n\n" + 
                "⏰ 15:15 - 16:45 \n📖 ЭЛЕКТИВНЫЕ ДИСЦ. ПО ФИЗИЧЕСКОЙ КУЛЬТУРЕ \n👤 [_преподаватель_] \n🧭 [_аудитория_]",
            "ср": "=== Верхняя неделя === \n" + 
                "⏰ 9:30 - 11:05 \n📖 Архитектура информационных систем пр.з. \n👤 [_преподаватель_] \n🧭 ауд. Л-207" + 
                "\n\n" + 
                "⏰ 11:15 - 12:50 \n📖 Операционные системы \n👤 ст. пр. Королькова Т.В. \n🧭 ауд. А-308" + 
                "\n\n" + 
                "⏰ 13:00 - 14:35 \n📖 Основы информационной безопасности \n👤 доц. Максименко В.Н. \n🧭 ауд. А-300",
            "чт": "=== Верхняя неделя === \n" + 
                "⏰ 13:00 - 14:35 \n📖 Основы информационной безопасности пр.з. \n👤 [_преподаватель_] \n🧭 ауд. А-260" + 
                "\n\n" + 
                "⏰ 15:15 - 16:45 \n📖 ОП в КИС пр.з. 7-18 нед. \n👤 [_преподаватель_] \n🧭 ауд. ВЦ-705" + 
                "\n\n" + 
                "⏰ 16:55 - 18:25 \n📖 ЭЛЕКТИВНЫЕ ДИСЦ. ПО ФИЗИЧЕСКОЙ КУЛЬТУРЕ \n👤 [_преподаватель_] \n🧭 [_аудитория_]",
            "пт": "=== Верхняя неделя === \n" + 
                "⏰ 9:30 - 11:05 \n📖 Операционные системы лаб. \n👤 [_преподаватель_] \n🧭 ауд. Л-504" + 
                "\n\n" + 
                "⏰ 11:15 - 12:50 \n📖 Архитектура информационных систем \n👤 доц. Беленькая М.Н. \n🧭 ауд. А-308" + 
                "\n\n" + 
                "⏰ 13:00 - 14:35 \n📖 Сетевые технологии пр.з. \n👤 [_преподаватель_] \n🧭 ауд. А-245" + 
                "\n\n" + 
                "⏰ 15:15 - 16:45 \n📖 Сетевые технологии лаб. \n👤 [_преподаватель_] \n🧭 ауд. А-261"
        },
        2 :{
            "пн": "=== Нижняя неделя === \n" + 
                "⏰ 11:15 - 12:50 \n📖 Средства и методы разработки информационных систем \n👤 доц. Гузеев А.В. \n🧭 ауд. А-300" + 
                "\n\n" + 
                "⏰ 13:00 - 14:35 \n📖 СиМРИС пр.з. \n👤 [_преподаватель_] \n🧭 ауд. Л-211",
            "вт": "=== Нижняя неделя === \n" + 
                "⏰ 9:30 - 11:05 \n📖 Архитектура информационных систем лаб. \n👤 [_преподаватель_] \n🧭 ауд. Л-207" + 
                "\n\n" + 
                "⏰ 11:15 - 12:50 \n📖 Сетевые технологии \n👤 ст.пр. Смирнов А.Э. \n🧭 ауд. А-414" + 
                "\n\n" + 
                "⏰ 13:00 - 14:35 \n📖 Основы ЭиЭЭ лаб. \n👤 [_преподаватель_] \n🧭 ауд. Л-511" + 
                "\n\n" + 
                "⏰ 15:15 - 16:45 \n📖 ЭЛЕКТИВНЫЕ ДИСЦ. ПО ФИЗИЧЕСКОЙ КУЛЬТУРЕ \n👤 [_преподаватель_] \n🧭 [_аудитория_]",
            "ср": "=== Нижняя неделя === \n" + 
                "⏰ 9:30 - 11:05 \n📖 Архитектура информационных систем пр.з. \n👤 [_преподаватель_] \n🧭 ауд. Л-207" + 
                "\n\n" + 
                "⏰ 11:15 - 12:50 \n📖 Операционные системы \n👤 ст. пр. Королькова Т.В. \n🧭 ауд. А-308" + 
                "\n\n" + 
                "⏰ 13:00 - 14:35 \n📖 Основы информационной безопасности \n👤 доц. Максименко В.Н. \n🧭 ауд. А-300",
            "чт": "=== Нижняя неделя === \n" + 
                "⏰ 13:00 - 14:35 \n📖 Основы информационной безопасности пр.з. \n👤 [_преподаватель_] \n🧭 ауд. А-260" + 
                "\n\n" + 
                "⏰ 15:15 - 16:45 \n📖 ОП в КИС пр.з. 7-18 нед. \n👤 [_преподаватель_] \n🧭 ауд. ВЦ-705" + 
                "\n\n" + 
                "⏰ 16:55 - 18:25 \n📖 ЭЛЕКТИВНЫЕ ДИСЦ. ПО ФИЗИЧЕСКОЙ КУЛЬТУРЕ \n👤 [_преподаватель_] \n🧭 [_аудитория_]",
            "пт": "=== Нижняя неделя === \n" + 
                "⏰ 9:30 - 11:05 \n📖 Операционные системы пр.з. \n👤 [_преподаватель_] \n🧭 ауд. Л-208" + 
                "\n\n" + 
                "⏰ 11:15 - 12:50 \n📖 Архитектура информационных систем \n👤 доц. Беленькая М.Н. \n🧭 ауд. А-308" + 
                "\n\n" + 
                "⏰ 13:00 - 14:35 \n📖 Сетевые технологии пр.з. \n👤 [_преподаватель_] \n🧭 ауд. А-245" + 
                "\n\n" + 
                "⏰ 15:15 - 16:45 \n📖 Сетевые технологии лаб. \n👤 [_преподаватель_] \n🧭 ауд. А-261"
        }
    },
    'брт1801':{
        1 :{
            "пн": "=== Верхняя неделя === \n" + 
                "⏰ 9:30 - 11:05 \n📖 Теория колебаний \n👤 проф. Горгадзе С.Ф. \n🧭 ауд. 512" + 
                "\n\n" + 
                "⏰ 11:15 - 12:50 \n📖 Теория колебаний пр.з. \n👤 [_преподаватель_] \n🧭 ауд. 512" + 
                "\n\n" + 
                "⏰ 13:00 - 14:35 \n" + "=== Верхняя неделя === \n" + "📖 ОТЦ \n👤 проф. Афанасьев В.П. \n🧭 ауд. 126 \n" + "=== Нижняя неделя === \n" + "📖 ОТЦ (2-10 нед.) \n👤 проф. Афанасьев В.П. \n🧭 ауд. 126" + 
                "\n\n" + 
                "⏰ 15:15 - 16:45 \n 📖 ОТЦ лаб. (9-17 нед.) \n👤 [_преподаватель_] \n🧭 ауд. 124",
        },
        2 :{
            "пн": "=== Нижняя неделя === \n" + 
                "⏰ 9:30 - 11:05 \n📖 Теория колебаний \n👤 проф. Горгадзе С.Ф. \n🧭 ауд. 512" + 
                "\n\n" + 
                "⏰ 11:15 - 12:50 \n📖 Теория колебаний пр.з. \n👤 [_преподаватель_] \n🧭 ауд. 512" + 
                "\n\n" + 
                "⏰ 13:00 - 14:35 \n" + "=== Верхняя неделя === \n" + "📖 ОТЦ \n👤 проф. Афанасьев В.П. \n🧭 ауд. 126 \n" + "=== Нижняя неделя === \n" + "📖 ОТЦ (2-10 нед.) \n👤 проф. Афанасьев В.П. \n🧭 ауд. 126" + 
                "\n\n" + 
                "⏰ 15:15 - 16:45 \n 📖 ОТЦ лаб. (9-17 нед.) \n👤 [_преподаватель_] \n🧭 ауд. 124",
        }
    },
    'брт1802':{
        1 :{
            "пн": "=== Верхняя неделя === \n" + 
                "⏰ 9:30 - 11:05 \n 📖 [_название пары_] \n 👤 [_преподаватель_] \n 🧭 [_аудитория_]"
        },
        2 :{
            "пн": "=== Нижняя неделя === \n" + 
                "⏰ 9:30 - 11:05 \n 📖 [_название пары_] \n 👤 [_преподаватель_] \n 🧭 [_аудитория_]"
        }
    },
    'зрс1801':{
        1 :{
            "пн": "=== Верхняя неделя === \n" + 
                "⏰ 11:15 - 12:50 \n📖 Математический анализ \n👤 проф. Данилов В.Г. \n🧭 ауд. 504а" + 
                "\n\n" + 
                "⏰ 13:00 - 14:35 \n📖 Методы программирования \n👤 доц. Волков А.И. \n🧭 ауд. 511" + 
                "\n\n" + 
                "⏰ 15:15 - 16:45 \n📖 ТЭЦ (пр.з. до 7 нед.) -  (лаб. с 9 нед.) \n👤 [_преподаватель_] \n🧭 ауд. 518" + 
                "\n\n" + 
                "⏰ 16:55 - 18:25 \n📖 МП лаб. \n👤 [_преподаватель_] \n🧭 ауд. 538",
            "вт": "=== Верхняя неделя === \n" + 
                "⏰ 13:00 - 14:35 \n📖 ЭЛЕКТИВНЫЕ ДИСЦ. ПО ФИЗИЧЕСКОЙ КУЛЬТУРЕ \n👤 [_преподаватель_] \n🧭 [_аудитория_]" + 
                "\n\n" + 
                "⏰ 15:15 - 16:45 \n📖 ТВиМС \n👤 доц. Лохвицкий М.С. \n🧭 ауд. 347" + 
                "\n\n" + 
                "⏰ 16:55 - 18:25 \n📖 Физика пр.з. \n👤 [_преподаватель_] \n🧭 ауд. 519",
            "ср": "=== Верхняя неделя === \n" + 
                "⏰ 11:15 - 12:50 \n📖 ФОЭ пр.з. \n👤 [_преподаватель_] \n🧭 ауд. 520" + 
                "\n\n" + 
                "⏰ 13:00 - 14:35 \n📖 ФОЭ \n👤 доц. Каравашкина В.Н. \n🧭 ауд. 526" + 
                "\n\n" + 
                "⏰ 15:15 - 16:45 \n📖 ФОЭ лаб. \n👤 [_преподаватель_] \n🧭 [_аудитория_]",
            "чт": "=== Верхняя неделя === \n" + 
                "⏰ 11:15 - 12:50 \n📖 Ин. яз. пр.з. \n👤 [_преподаватель_] \n🧭 ауд. 301б" + 
                "\n\n" + 
                "⏰ 13:00 - 14:35 \n📖 ЭЛЕКТИВНЫЕ ДИСЦ. ПО ФИЗИЧЕСКОЙ КУЛЬТУРЕ \n👤 [_преподаватель_] \n🧭 [_аудитория_]" + 
                "\n\n" + 
                "⏰ 15:15 - 16:45 \n📖 ТВиМС пр.з. \n👤 [_преподаватель_] \n🧭 ауд. 302",
            "пт": "=== Верхняя неделя === \n" + 
                "⏰ 11:15 - 12:50 \n📖 МА пр.з. \n👤 проф. Данилов В.Г. \n🧭 ауд. 302" + 
                "\n\n" + 
                "⏰ 13:00 - 14:35 \n📖 Языки программирования \n👤 доц. Волков А.И. \n🧭 ауд. 310" + 
                "\n\n" + 
                "⏰ 15:15 - 16:45 \n📖 ТЭЦ \n👤 доц. Фриск В.В. \n🧭 ауд. 126" + 
                "\n\n" + 
                "⏰ 16:55 - 18:25 \n📖 ЯП пр.з. \n👤 [_преподаватель_] \n🧭 ауд. 540"
        },
        2 :{
            "пн": "=== Нижняя неделя === \n" + 
                "⏰ 11:15 - 12:50 \n📖 Математический анализ \n👤 проф. Данилов В.Г. \n🧭 ауд. 504а" + 
                "\n\n" + 
                "⏰ 13:00 - 14:35 \n📖 Физика \n👤 ст.пр. Ростовцева А.А. \n🧭 ауд. 226" + 
                "\n\n" + 
                "⏰ 15:15 - 16:45 \n📖 ТЭЦ (пр.з. до 7 нед.) -  (лаб. с 9 нед.) \n👤 [_преподаватель_] \n🧭 ауд. 518" + 
                "\n\n" + 
                "⏰ 16:55 - 18:25 \n📖 МП лаб. \n👤 [_преподаватель_] \n🧭 ауд. 538",
            "вт": "=== Нижняя неделя === \n" + 
                "⏰ 13:00 - 14:35 \n📖 ЭЛЕКТИВНЫЕ ДИСЦ. ПО ФИЗИЧЕСКОЙ КУЛЬТУРЕ \n👤 [_преподаватель_] \n🧭 [_аудитория_]" + 
                "\n\n" + 
                "⏰ 15:15 - 16:45 \n📖 ТВиМС \n👤 доц. Лохвицкий М.С. \n🧭 ауд. 347" + 
                "\n\n" + 
                "⏰ 16:55 - 18:25 \n📖 Физика лаб. \n👤 [_преподаватель_] \n🧭 ауд. 332",
            "ср": "=== Нижняя неделя === \n" + 
                "⏰ 11:15 - 12:50 \n📖 ФОЭ пр.з. \n👤 [_преподаватель_] \n🧭 ауд. 520" + 
                "\n\n" + 
                "⏰ 13:00 - 14:35 \n📖 ФОЭ \n👤 доц. Каравашкина В.Н. \n🧭 ауд. 526" + 
                "\n\n" + 
                "⏰ 15:15 - 16:45 \n📖 ФОЭ лаб. \n👤 [_преподаватель_] \n🧭 [_аудитория_]",
            "чт": "=== Нижняя неделя === \n" + 
                "⏰ 11:15 - 12:50 \n📖 Ин. яз. пр.з. \n👤 [_преподаватель_] \n🧭 ауд. 301б" + 
                "\n\n" + 
                "⏰ 13:00 - 14:35 \n📖 ЭЛЕКТИВНЫЕ ДИСЦ. ПО ФИЗИЧЕСКОЙ КУЛЬТУРЕ \n👤 [_преподаватель_] \n🧭 [_аудитория_]" + 
                "\n\n" + 
                "⏰ 15:15 - 16:45 \n📖 ТВиМС пр.з. \n👤 [_преподаватель_] \n🧭 ауд. 302",
            "пт": "=== Нижняя неделя === \n" + 
                "⏰ 11:15 - 12:50 \n📖 МА пр.з. \n👤 проф. Данилов В.Г. \n🧭 ауд. 302" + 
                "\n\n" + 
                "⏰ 13:00 - 14:35 \n📖 Языки программирования \n👤 доц. Волков А.И. \n🧭 ауд. 310" + 
                "\n\n" + 
                "⏰ 15:15 - 16:45 \n📖 ТЭЦ \n👤 доц. Фриск В.В. \n🧭 ауд. 126" + 
                "\n\n" + 
                "⏰ 16:55 - 18:25 \n📖 ЯП лаб. \n👤 [_преподаватель_] \n🧭 ауд. 540"
        }
    },
    'зрс1802':{
        1 :{
            "пн": "=== Верхняя неделя === \n" + 
                "⏰ 11:15 - 12:50 \n📖 Математический анализ \n👤 проф. Данилов В.Г. \n🧭 ауд. 504а" + 
                "\n\n" + 
                "⏰ 13:00 - 14:35 \n📖 Методы программирования \n👤 доц. Волков А.И. \n🧭 ауд. 511" + 
                "\n\n" + 
                "⏰ 15:15 - 16:45 \n📖 ТЭЦ (пр.з. до 8 нед.) -  (лаб. с 10 нед.) \n👤 [_преподаватель_] \n🧭 ауд. 518" + 
                "\n\n" + 
                "⏰ 16:55 - 18:25 \n📖 МП лаб. \n👤 [_преподаватель_] \n🧭 ауд. 538",
            "вт": "=== Верхняя неделя === \n" + 
                "⏰ 11:15 - 12:50 \n📖 ЭЛЕКТИВНЫЕ ДИСЦ. ПО ФИЗИЧЕСКОЙ КУЛЬТУРЕ \n👤 [_преподаватель_] \n🧭 [_аудитория_]" + 
                "\n\n" + 
                "⏰ 13:00 - 14:35 \n📖 ТВиМС пр.з. \n👤 [_преподаватель_] \n🧭 ауд. 508" + 
                "\n\n" + 
                "⏰ 15:15 - 16:45 \n📖 ТВиМС \n👤 доц. Лохвицкий М.С. \n🧭 ауд. 347",
            "ср": "=== Верхняя неделя === \n" + 
                "⏰ 11:15 - 12:50 \n📖 ФОЭ пр.з. \n👤 [_преподаватель_] \n🧭 ауд. 520" + 
                "\n\n" + 
                "⏰ 13:00 - 14:35 \n📖 ФОЭ \n👤 доц. Каравашкина В.Н. \n🧭 ауд. 526" + 
                "\n\n" + 
                "⏰ 15:15 - 16:45 \n📖 ФОЭ лаб. \n👤 [_преподаватель_] \n🧭 [_аудитория_]",
            "чт": "=== Верхняя неделя === \n" + 
                "⏰ 11:15 - 12:50 \n📖 Ин. яз. пр.з. \n👤 [_преподаватель_] \n🧭 ауд. 305, 512" + 
                "\n\n" + 
                "⏰ 13:00 - 14:35 \n📖 МА пр.з. \n👤 Куприн А.В. \n🧭 ауд. 302" + 
                "\n\n" + 
                "⏰ 15:15 - 16:45 \n📖 ЭЛЕКТИВНЫЕ ДИСЦ. ПО ФИЗИЧЕСКОЙ КУЛЬТУРЕ \n👤 [_преподаватель_] \n🧭 [_аудитория_]" + 
                "\n\n" + 
                "⏰ 16:55 - 18:25 \n📖 Физика лаб. \n👤 [_преподаватель_] \n🧭 ауд. 332",
            "пт": "=== Верхняя неделя === \n" + 
                "⏰ 11:15 - 12:50 \n📖 ЯП пр.з. \n👤 [_преподаватель_] \n🧭 ауд. 531" + 
                "\n\n" + 
                "⏰ 13:00 - 14:35 \n📖 Языки программирования \n👤 доц. Волков А.И. \n🧭 ауд. 310" + 
                "\n\n" + 
                "⏰ 15:15 - 16:45 \n📖 ТЭЦ \n👤 доц. Фриск В.В. \n🧭 ауд. 126"
        },
        2 :{
            "пн": "=== Нижняя неделя === \n" + 
                "⏰ 11:15 - 12:50 \n📖 Математический анализ \n👤 проф. Данилов В.Г. \n🧭 ауд. 504а" + 
                "\n\n" + 
                "⏰ 13:00 - 14:35 \n📖 Физика \n👤 ст.пр. Ростовцева А.А. \n🧭 ауд. 226" + 
                "\n\n" + 
                "⏰ 15:15 - 16:45 \n📖 ТЭЦ (пр.з. до 8 нед.) -  (лаб. с 10 нед.) \n👤 [_преподаватель_] \n🧭 ауд. 518" + 
                "\n\n" + 
                "⏰ 16:55 - 18:25 \n📖 МП лаб. \n👤 [_преподаватель_] \n🧭 ауд. 538",
            "вт": "=== Нижняя неделя === \n" + 
                "⏰ 11:15 - 12:50 \n📖 ЭЛЕКТИВНЫЕ ДИСЦ. ПО ФИЗИЧЕСКОЙ КУЛЬТУРЕ \n👤 [_преподаватель_] \n🧭 [_аудитория_]" + 
                "\n\n" + 
                "⏰ 13:00 - 14:35 \n📖 ТВиМС пр.з. \n👤 [_преподаватель_] \n🧭 ауд. 508" + 
                "\n\n" + 
                "⏰ 15:15 - 16:45 \n📖 ТВиМС \n👤 доц. Лохвицкий М.С. \n🧭 ауд. 347",
            "ср": "=== Нижняя неделя === \n" + 
                "⏰ 11:15 - 12:50 \n📖 ФОЭ пр.з. \n👤 [_преподаватель_] \n🧭 ауд. 520" + 
                "\n\n" + 
                "⏰ 13:00 - 14:35 \n📖 ФОЭ \n👤 доц. Каравашкина В.Н. \n🧭 ауд. 526" + 
                "\n\n" + 
                "⏰ 15:15 - 16:45 \n📖 ФОЭ лаб. \n👤 [_преподаватель_] \n🧭 [_аудитория_]",
            "чт": "=== Нижняя неделя === \n" + 
                "⏰ 11:15 - 12:50 \n📖 Ин. яз. пр.з. \n👤 [_преподаватель_] \n🧭 ауд. 305, 512" + 
                "\n\n" + 
                "⏰ 13:00 - 14:35 \n📖 МА пр.з. \n👤 Куприн А.В. \n🧭 ауд. 302" + 
                "\n\n" + 
                "⏰ 15:15 - 16:45 \n📖 ЭЛЕКТИВНЫЕ ДИСЦ. ПО ФИЗИЧЕСКОЙ КУЛЬТУРЕ \n👤 [_преподаватель_] \n🧭 [_аудитория_]" + 
                "\n\n" + 
                "⏰ 16:55 - 18:25 \n📖 Физика пр.з. \n👤 [_преподаватель_] \n🧭 ауд. 512",
            "пт": "=== Нижняя неделя === \n" + 
                "⏰ 11:15 - 12:50 \n📖 ЯП \n👤 [_преподаватель_] \n🧭 лаб. 531" + 
                "\n\n" + 
                "⏰ 13:00 - 14:35 \n📖 Языки программирования \n👤 доц. Волков А.И. \n🧭 ауд. 310" + 
                "\n\n" + 
                "⏰ 15:15 - 16:45 \n📖 ТЭЦ \n👤 доц. Фриск В.В. \n🧭 ауд. 126"
        }
    },
    'бст1901':{
        1 :{
            "пн": "=== Верхняя неделя === \n" + 
                "⏰ 9:30 - 11:05 \n📖 История \n👤 доц. Кунц Е.В. \n🧭 ауд. 227" + 
                "\n\n" + 
                "⏰ 11:15 - 12:50 \n📖 Алгебра и геометрия \n👤 доц. Маненков С.А. \n🧭 ауд. 514" + 
                "\n\n" + 
                "⏰ 13:00 - 14:35 \n📖 Алгебра и геометрия пр.з. \n👤 доц. Маненков С.А. \n🧭 ауд. 308" + 
                "\n\n" + 
                "⏰ 15:15 - 16:45 \n📖 Физическая культура",
            "вт": "=== Верхняя неделя === \n" + 
                "⏰ 11:15 - 12:50 \n📖 Введение в профессию \n👤 [_преподаватель_] \n🧭 Авиамоторная ауд. А-413" + 
                "\n\n" + 
                "⏰ 13:00 - 14:35 \n📖 Введение в профессию \n👤 ст.пр. Маклачкова В.В. \n🧭 Авиамоторная ауд. А-310" + 
                "\n\n" + 
                "⏰ 15:15 - 16:45 \n📖 Информатика пр.з. \n👤 доц. Гуриков С.Р. \n🧭 ауд. 540",
            "ср": "=== Верхняя неделя === \n" + 
                "⏰ 13:00 - 14:35 \n📖 Ин. яз. пр.з. \n👤 [_преподаватель_] \n🧭 ауд. 328, 520" + 
                "\n\n" + 
                "⏰ 15:15 - 16:45 \n📖 История пр.з. \n👤 [_преподаватель_] \n🧭 ауд. 318",
            "чт": "=== Верхняя неделя === \n" + 
                "⏰ 9:30 - 11:05 \n📖 Информатика лаб. \n👤 доц. Гуриков С.Р. \n🧭 ауд. 538" + 
                "\n\n" + 
                "⏰ 11:15 - 12:50 \n📖 Математический анализ \n👤 доц. Маненков С.А. \n🧭 ауд. 301" + 
                "\n\n" + 
                "⏰ 13:00 - 14:35 \n📖 Физическая культура" + 
                "\n\n" + 
                "⏰ 15:15 - 16:45 \n📖 Математический анализ пр.з. \n👤 доц. Маненков С.А. \n🧭 ауд. 219",
            "пт": "=== Верхняя неделя === \n" + 
                "⏰ 11:15 - 12:50 \n📖 Ин. яз. пр.з. \n👤 [_преподаватель_] \n🧭 ауд. 520, 524" + 
                "\n\n" + 
                "⏰ 13:00 - 14:35 \n📖 РЯиКР пр.з. \n👤 [_преподаватель_] \n🧭 ауд. 328"
        },
        2 :{
            "пн": "=== Нижняя неделя === \n" + 
                "⏰ 9:30 - 11:05 \n📖 История \n👤 доц. Кунц Е.В. \n🧭 ауд. 227" + 
                "\n\n" + 
                "⏰ 11:15 - 12:50 \n📖 Алгебра и геометрия \n👤 доц. Маненков С.А. \n🧭 ауд. 514" + 
                "\n\n" + 
                "⏰ 13:00 - 14:35 \n📖 Алгебра и геометрия пр.з. \n👤 доц. Маненков С.А. \n🧭 ауд. 308" + 
                "\n\n" + 
                "⏰ 15:15 - 16:45 \n📖 Физическая культура",
            "вт": "=== Нижняя неделя === \n" + 
                "⏰ 11:15 - 12:50 \n📖 Введение в профессию \n👤 [_преподаватель_] \n🧭 Авиамоторная ауд. А-413" + 
                "\n\n" + 
                "⏰ 13:00 - 14:35 \n📖 Информатика \n👤 доц. Гуриков С.Р. \n🧭 ауд. 511" + 
                "\n\n" + 
                "⏰ 15:15 - 16:45 \n📖 Информатика пр.з. \n👤 доц. Гуриков С.Р. \n🧭 ауд. 540",
            "ср": "=== Нижняя неделя === \n" + 
                "⏰ 13:00 - 14:35 \n📖 Ин. яз. пр.з. \n👤 [_преподаватель_] \n🧭 ауд. 328, 520" + 
                "\n\n" + 
                "⏰ 15:15 - 16:45 \n📖 История пр.з. \n👤 [_преподаватель_] \n🧭 ауд. 318",
            "чт": "=== Нижняя неделя === \n" + 
                "⏰ 9:30 - 11:05 \n📖 Информатика лаб. \n👤 доц. Гуриков С.Р. \n🧭 ауд. 538" + 
                "\n\n" + 
                "⏰ 11:15 - 12:50 \n📖 Математический анализ \n👤 доц. Маненков С.А. \n🧭 ауд. 301" + 
                "\n\n" + 
                "⏰ 13:00 - 14:35 \n📖 Физическая культура" + 
                "\n\n" + 
                "⏰ 15:15 - 16:45 \n📖 Математический анализ пр.з. \n👤 доц. Маненков С.А. \n🧭 ауд. 219",
            "пт": "=== Нижняя неделя === \n" + 
                "⏰ 11:15 - 12:50 \n📖 Ин. яз. пр.з. \n👤 [_преподаватель_] \n🧭 ауд. 520, 524" + 
                "\n\n" + 
                "⏰ 13:00 - 14:35 \n📖 РЯиКР пр.з. \n👤 [_преподаватель_] \n🧭 ауд. 328"
        }
    },
    # Тестовая группа с тестовым днём
    'test':{
        "пн": "⏰ 9:30 - 11:05 \n 📖 [_название пары_] \n 👤 [_преподаватель_] \n 🧭 [_аудитория_]" + 
            "\n\n" + 
            "⏰ 11:15 - 12:50 \n" + "=== Верхняя неделя === \n" + "📖 [_название пары_] \n 👤 [_преподаватель_] \n 🧭 [_аудитория_] \n" + "=== Нижняя неделя === \n" + "📖 [_название пары_] \n 👤 [_преподаватель_] \n 🧭 [_аудитория_]"
    }
}
