raspisanie = {
    'брв1701': {
        "пн": "9:30 - 11:05 - нет пар"+ "\n" + "11:15 - 12:50 - пары есть",
        "вт": "9:30 - 11:05 - нет пар" + "\n" + "11:15 - 12:50 - пары есть",
        "пт": "⏰ 9:30 - 11:05 \n 📖  \n 👤  \n 🧭" + "\n" + "11:15 - 12:50 - " + "\n" + "13:00 - 14:35 - "  + "\n" + "15:15 - 16:45 - " + "\n" + "16:55 - 18:25 - "
    },
    'зрс1701':{
        "пн": "⏰ 9:30 - 11:05 \n 📖 ЦОС \n 👤 доц. Лобов Е.М. \n 🧭 ауд."+ "\n\n" + "⏰ 11:15 - 12:50 \n 📖 Электромагнитные поля и волны \n 👤 доц. Муравцов А.Д. \n 🧭 ауд. А-422" + "\n\n" + "⏰ 13:00 - 14:35 \n 📖 Физическая культура" + "\n\n" + "⏰ 15:15 - 16:45 \n 📖 ЦОС пр.з. \n 👤 Мирошникова Н.Е. \n 🧭 ауд.",
        "вт": "⏰ 11:15 - 12:50 \n 📖 ЦОС лаб. \n 👤 Мирошникова Н.Е. Минаева О.Н. \n 🧭 ауд. " + "\n\n" + "⏰ 13:00 - 14:35 \n 📖 ТРС \n 👤 доц. Лобов Е.М. \n 🧭 ауд. Л-601"  + "\n\n" + "⏰ 15:15 - 16:45 \n" + "=== Верхняя неделя === \n" + "📖 ТРС \n 👤 доц. Лобов Е.М. \n 🧭 ауд. Л-601 \n" + "=== Нижняя неделя === \n" + "📖 ТРС пр.з. \n 👤  \n 🧭 ауд. Л-607" + "\n\n" + "⏰ 16:55 - 18:25 \n 📖 Физическая культура",
        "ср": "⏰ 11:15 - 12:50 \n 📖 ЭиС \n 👤 ст.пр. Ильина Л.Н. \n 🧭 ауд. А-407" + "\n\n" + "⏰ 13:00 - 14:35 \n" + "=== Верхняя неделя === \n" + "📖 ЭиС пр.з. \n 👤 ст.пр. Ильина Л.Н. \n 🧭 ауд. Л-505 \n" + "=== Нижняя неделя === \n" + "📖 ЭиС лаб. \n 👤 ст.пр. Ильина Л.Н. \n 🧭 ауд. Л-505" + "\n\n" + "⏰ 15:15 - 16:45 \n 📖 КиОЭ \n 👤 проф. Елизаров А.А. \n 🧭 ауд. А-306" + "\n\n" + "⏰ 16:55 - 18:25 \n 📖 КиОЭ лаб. \n 👤  \n 🧭 ауд.",
        "чт": "⏰ 9:30 - 11:05 \n 📖 УПсУИБ \n 👤 Симонов П.И. \n 🧭 ауд. ЗФ-301" + "\n\n" + "⏰ 11:15 - 12:50 \n 📖 ОПсУИБ \n 👤 Симонов П.И. \n 🧭 ауд. ЗФ-301" + "\n\n" + "⏰ 13:00 - 14:35 \n 📖 ОПсУИБ \n 👤 Симонов П.И. \n 🧭 ауд. ЗФ-301" + "\n\n" + "⏰ 15:15 - 16:45 \n 📖 УПсУИБ пр.з. \n 👤 Симонов П.И. \n 🧭 ауд. ЗФ-301",
        "пт": "⏰ 9:30 - 11:05 \n" + "=== Верхняя неделя === \n" + "📖 ЭМПиВ пр.з. \n 👤  \n 🧭 ауд. А-407 \n" + "=== Нижняя неделя === \n" + "📖 ЭМПиВ лаб. \n 👤  \n 🧭 ауд. Л-714" + "\n\n" + "⏰ 11:15 - 12:50 \n" + "=== Верхняя неделя === \n" + "📖 ТЭС лаб. \n 👤  \n 🧭 ауд. А-  \n" + "=== Нижняя неделя === \n" + "📖 ТЭС пр.з. \n 👤  \n 🧭 ауд. А-409" + "\n\n" + "⏰ 13:00 - 14:35 \n 📖 ТЭС \n 👤 доц. Мамонтов А.В.  \n 🧭 ауд. А-409" + "\n\n" + "⏰ 15:15 - 16:45 \n 📖 ТРС лаб. \n 👤  \n 🧭 ауд. Л-603"
    },
    # Тестовая группа с тестовым днём
    'test':{
        "пн": "⏰ 9:30 - 11:05 \n 📖 [_название пары_] \n 👤 [_преподаватель_] \n 🧭 [_аудитория_]" + 
        "\n\n" + 
        "⏰ 11:15 - 12:50 \n" + "=== Верхняя неделя === \n" + "📖 [_название пары_] \n 👤 [_преподаватель_] \n 🧭 [_аудитория_] \n" + "=== Нижняя неделя === \n" + "📖 [_название пары_] \n 👤 [_преподаватель_] \n 🧭 [_аудитория_]"
    }
}

from vk_api.longpoll import VkLongPoll, VkEventType
import vk_api
from datetime import datetime

token = "25a99390fbbb59c3b9c4ad2bb0094a2cf7b3e36857687b9f8d418ea7646f0526b9d9b5c9c392b99e7dfed"
vk_session = vk_api.VkApi(token=token)

session_api = vk_session.get_api()
longpoll = VkLongPoll(vk_session)

mess = "hello friend!!!"

while True:
    for event in longpoll.listen():
        if event.type == VkEventType.MESSAGE_NEW:
            #print('Сообщение пришло в: ' + str(datetime.strftime(datetime.now(), "%H:%M:%S")))
            #print('Текст сообщения: ' + str(event.text))
            #print(event.user_id)
            response = event.text.lower()
            response_2 = response.split()
            if event.from_user and not (event.from_me):
                for arr in raspisanie:
                    if str(response_2[0]) == arr:
                        for arr1 in raspisanie[arr].items():
                            if str(response_2[1]) == str(arr1[0]):
                                vk_session.method('messages.send', {'user_id': event.user_id, 'message': str(arr1[1]), 'random_id': 0})
                if str(response_2[0]) == "помощь":
                    mess = "расписание, [номер группы] [день недели]"+ "\n" + "Примеры команд: зрс1701 вт"
                    vk_session.method('messages.send', {'user_id': event.user_id, 'message': mess, 'random_id': 0})
